In [1]:
import pandas as pd
import numpy as np

In [4]:
# 1.
# (1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

# (2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

ser1=pd.Series(np.arange(6), index = np.arange(6))
ser2=pd.Series(np.arange(6), index = np.arange(6))
ser3=ser1*ser2
ser3

0     0
1     1
2     4
3     9
4    16
5    25
dtype: int32

In [13]:
# 2.
# 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

# (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

# (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

frame=pd.DataFrame(index=[1,2,3,4,5],columns=["int",'string','float'])
frame['int']=np.arange(5)
frame['string']=['가','나','다','라','마']
frame['float']=np.arange(5.)
frame

   int string  float
1    0      가    0.0
2    1      나    1.0
3    2      다    2.0
4    3      라    3.0
5    4      마    4.0

In [ ]:
# 3.
# 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

# (5) 춘향의 점수를 데이터프레임으로 나타낸다.

# (6) 향단의 점수를 시리즈로 나타낸다.

In [18]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [21]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [24]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['수학','영어']]

    수학  영어
춘향  90  90
몽룡  60  70
향단  80  60
방자  70  40

In [31]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df["평균"] = df.mean(axis=1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [43]:
#(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df.iloc[3,1]=80
df.iloc[-1,-1]=df.loc['방자'].mean()
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  56.666667

In [45]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
pd.DataFrame(df.iloc[0])

           춘향
국어  80.000000
영어  90.000000
수학  90.000000
평균  86.666667

In [47]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [49]:
df.loc['과목평균']=df.mean(axis=0)
df

        국어    영어    수학         평균
춘향    80.0  90.0  90.0  86.666667
몽룡    90.0  70.0  60.0  73.333333
향단    70.0  60.0  80.0  70.000000
방자    30.0  80.0  70.0  56.666667
과목평균  67.5  75.0  75.0  71.666667